Revit 2022 API
IndependentTag.TaggedElementId Property
 The LinkElementId of the tagged element, if any. If the tag is tagged on a subelement of linked element, it returns the LinkElementId of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedElementIds()` method instead.")]
public LinkElementId TaggedElementId { get; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedElementIds()` method instead.")> _
Public ReadOnly Property TaggedElementId As LinkElementId
	Get
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedElementIds()` method instead.")]
public:
property LinkElementId^ TaggedElementId {
	LinkElementId^ get ();
}
Remarks
 The ID of the tagged element. If there is no tagged element because the tag IsOrphaned then LinkElementId.HostElementId, LinkElementId.LinkElementId and LinkElementId.LinkInstanceId will be InvalidElementId.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace